getting simular error as below:

`Terraform will perform the following actions:

  # module.xxxx-terraform.bitbucket_repository.this will be created
  + resource "bitbucket_repository" "this" {
      + clone_https       = (known after apply)
      + clone_ssh         = (known after apply)
      + description       = "Terraform managed repository"
      + fork_policy       = "no_public_forks"
      + has_issues        = false
      + has_wiki          = false
      + id                = (known after apply)
      + is_private        = true
      + name              = "xxxx-terraform.tf"
      + owner             = "xxxx"
      + pipelines_enabled = false
      + project_key       = "xxx"
      + scm               = "git"
      + slug              = (known after apply)
      + uuid              = (known after apply)

      + link {
          + avatar {
              + href = (known after apply)
            }
        }
    }`

get the error:
`│ Error: error creating repository (xxxx-terraform-tf): undefined response type
│ 
│   with module.xxxx-terraform.bitbucket_repository.this,
│   on .terraform/modules/xxxx-terraform/main.tf line 5, in resource "bitbucket_repository" "this":
│    5: resource "bitbucket_repository" "this" {`
